### Forest Sync Check Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.sync_check.data.local_file.init: Reading...
module.sync_check.data.digitalocean_ssh_keys.keys: Reading...
module.sync_check.data.digitalocean_project.forest_project: Reading...
module.sync_check.data.local_file.init: Read complete after 0s [id=0866fb64d7c492d05f70c7683ce80ad3846ef31d]
module.sync_check.data.external.sources_tar: Reading...
module.sync_check.data.external.sources_tar: Read complete after 0s [id=-]
module.sync_check.data.local_file.sources: Reading...
module.sync_check.data.local_file.sources: Read complete after 0s [id=60e0bce8f2ddd1b08ec34c15117833c6fb4bf91e]
module.sync_check.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/4003270040538543685]
module.sync_check.digitalocean_droplet.forest: Refreshing state... [id=361520347]
module.sync_check.data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.sync_check.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.sync_check.digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2023-06-20T14:15:38Z" -> (known after apply)
      ~ disk                 = 300 -> (known after apply)
      ~ id                   = "361520347" -> (known after apply)
      ~ ipv4_address         = "134.122.82.163" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.2" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 16384 -> (known after apply)
        name                 = "forest-sync-check"
      ~ price_hourly         = 0.19494 -> (known after apply)
      ~ price_monthly        = 131 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "iac",
        ]
      ~ urn                  = "do:droplet:361520347" -> (known after apply)
      ~ user_data            = "b5a0795aca0527f15aeddd82b4c56f952f1124ae" -> "ccc11a01c3e50ab965046da7d0b4d09ec058646b" # forces replacement
      ~ vcpus                = 2 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.sync_check.digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:361520347",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ ip = [
      - [
          - "134.122.82.163",
        ],
      + [
          + (known after apply),
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>